Revit 2027 API
LinkLoadResult.GetExternalResourceReference Method
 Gets a copy of the ExternalResourceReference corresponding to the link.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExternalResourceReference GetExternalResourceReference()
Public Function GetExternalResourceReference As ExternalResourceReference
public:
ExternalResourceReference^ GetExternalResourceReference()
member GetExternalResourceReference : unit -> ExternalResourceReference
Return Value
ExternalResourceReference
 A copy of the ExternalResourceReference corresponding to the link.
See Also
Reference
LinkLoadResult Class
Autodesk.Revit.DB Namespace